app/controllers/invoices_controller.rb

SELECT "invoices".* FROM "invoices"
---
  def index
    @invoices = Invoice.all

SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @invoice = Invoice.find(params[:id])